# RebarTrimExtendData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarTrimExtendData Class
Members See Also
---
The class that contains the information needed to calculate and return the curves in a trimmed/extended state, and also find the constraints that trim/extend it.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class RebarTrimExtendData : IDisposable
```

Visual Basic
---
```text
Public Class RebarTrimExtendData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RebarTrimExtendData : IDisposable
```

# Remarks
If new curves will be added by calling addBarGeometry(), the existing curves in Rebar element will be replaced with these curves. It will not add curves to the existing ones.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarTrimExtendData
# See Also
RebarTrimExtendData Members
Autodesk.Revit.DB.Structure Namespace